<!DOCTYPE html>
<html lang="en">

<head>
	<title>WebGl</title>
	<meta charset="utf-8">
	<meta name="viewport" content="width=device-width, user-scalable=no, minimum-scale=1.0, maximum-scale=1.0">
	<!--<link type="text/css" rel="stylesheet" href="main.css">	-->
</head>

<body>
		

	<div style="max-width: 1200px; min-width: 400px; margin: 0px auto; font-family: arial,sans-serif; font-size: 18px; color: #666;">	
		<div style="margin-top: 70px;">
			1. <a href="p1/index.php?demo=4" target="_blank">3D конструктор дома</a> Вначале загружается сохраненная квартира/дом. Можно переключиться между видами 2D/3D (кнопка в правом верхнем углу) и затем с помощью мыши (управление правой и левой кнопкой + колесико) перемещаться. В 2D можно строить стены, добавлять окна/двери, крышу. В 2D/3D менять текстуры стен/пола. Переключаться между этажами через правую панель (вкладка этажи). Через правую панель (вкладка каталог) можно добавлять объекты (примитивы, диваны, сантехнику и т.д.). Это полноценный редактор строительства загородного дома. 
		</div>
		
		<div style="margin-top: 15px;">
			2. <a href="gl2/" target="_blank">3D конструктор отопления</a> сделан по схожей схеме, как конструктор дома. Основной профиль построение системы отопления. Особенность этого проекта в том, что все детали, фитинги, трубы, радиаторы являются параметрическими, что значительно увеличивает скорость загрузки сцены.
		</div>		
		
		<div style="margin-top: 15px;">
			3. <a href="loaderObj/" target="_blank">загрузчик моделей</a> позволяет загрузить 3D объекты в самых популярных форматах (.fbx, .3ds, .obj, .dae), настроить типы материалов и цвета, изменить масштаб объекта и сохранить полученный результат в базу данных.  
		</div>	

		<div style="margin-top: 15px;">
			4. <a href="p5/" target="_blank">3D обзор квартиры</a> происходит загрузка 3D модели квартиры с готовыми текстурами и лайтмапами.  
		</div>	
		
		<div style="margin-top: 15px;">
			5. <a href="v360/" target="_blank">демонстрация квартиры</a> происходит загрузка 3D модели квартиры (без текстур) и  отдельно подгружаются текстуры, которые объединяются в панорамы (сферическую текстуру), затем с помощью написанного шейдера проецируются на 3D модель квартиры и при перемещение создается впечатление реального передвижения по квартире.  
		</div>				
		
	</div>


</body>


</html>